Tekla Open API Reference for Tekla Structures 2025
ProfileItem Class
 The ProfileItem abstract class contains the common information of catalog profiles (parametric and library).
Inheritance Hierarchy
System.Object
 Tekla.Structures.Catalogs.ProfileItem
 Tekla.Structures.Catalogs.LibraryProfileItem
 Tekla.Structures.Catalogs.ParametricProfileItem
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public abstract class ProfileItem
Public MustInherit Class ProfileItem
The ProfileItem type exposes the following members.
Properties
Name | Description
aProfileItemCrossSections |  Obsolete.
 An array list with the profile item cross-sections.
aProfileItemParameters
 An array list with the profile item parameters.
IsCLBProfile
 Whether the profile is a clb profile.
IsHardcodedProfile
 Whether the profile is a parametric user-defined hard coded profile.
IsMultiCrossSectionUserParametric
 Whether the profile is a parametric user-defined multi cross section profile.
IsSketchedUserParametric
 Whether the profile is a parametric user-defined sketched profile.
NumberOfCrossSections
 The number of cross sections in the profile item.
ParameterString
 The profile item parameter string.
ProfileItemCrossSections
 The list of profile item cross-sections.
ProfileItemSubType
 The profile item subtype.
ProfileItemType
 The profile item type.
Top
Methods
Name | Description
AddCrossSection
 Adds the cross section to a profile.
DeleteCrossSection
 Deletes the cross section of a profile.
Export
 Exports the profile item in the profile database to given file name. Currently library profiles, sketch profiles and clb profiles are supported. Library profiles are exported to *.lis format. Sketch profiles are exported to *.uel format. Clb profiles are exported to *.clb format. If path is not given profile is exported to model folder. If filename is empty profile name or prefix is used as filename.
GetCrossSection
 Returns list of cross section points of inner surfaces from the profile item.
GetHighAccuracyCrossSection
 Get cross section with high accuracy.
GetProfileItemSubTypes()
 Selects the profile item and updates the sub types in the profile database.
GetProfileItemSubTypes(ProfileItem, ProfileItem.ProfileItemTypeEnum)
IsProfileUserDefined
 Whether the profile is a fixed user-defined profile.
IsProfileUserParametric
 Whether the profile is a parametric user-defined profile. If so, the prefix can be asked by type and subtype.
ModifyCrossSection
 Modifies the cross section of a profile.
ModifyProfileItemAnalysisParameter
 Modify analysis parameter of library profile item. Modify is needed for profile item for updating changes to profile database
ModifyProfileItemParameter
 Modify parameter of library profile item. Modify is needed for profile item for updating changes to profile database
ModifyProfileItemUserParameter
 Modify user parameter of library profile item. Modify is needed for profile item for updating changes to profile database
Select
 Selects the profile item in the profile database.
SelectCrossSections
 Selects the profile item cross section in the profile database.
SetEquivalentType
 Sets the equivalent type for the specified cross section.
Top
See Also
Reference
Tekla.Structures.Catalogs Namespace